Tekla.Structures.Analysis.AnalysisDecomposedBarLoad
The AnalysisDecomposedBarLoad class contains information related to decomposed bar loads.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad._CSCode
The CS code of the analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad._StartDistance
SThe start distance of the analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad._EndDistance
The end distance of the analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad._StartValue
The start value of the analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad._EndValue
The end value of the analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.CSCode
The CS code of the decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.StartDistance
The start distance of the decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.EndDistance
The end distance of the decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.StartValue
The start value of the decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.EndValue
The end value of the decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.Select
Selects an analysis decomposed bar load.

Tekla.Structures.Analysis.AnalysisDecomposedBarLoad.SelectInstance
DO NOT USE! For internal usage only!